update the nvida H100 arch analysis
